app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page], :per_page => 3)
---
SELECT "posts".* FROM "posts" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ('fff', 'fff', '2012-03-31 23:58:56.021618', '2012-03-31 23:58:56.021618')

  def edit
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 5) LIMIT 1

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 5) LIMIT 1
UPDATE "posts" SET "title" = 'Darth vader', "content" = 'take a peek!', "updated_at" = '2012-04-01 03:34:45.797941' WHERE ("posts"."id" = 3)

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1
DELETE FROM "posts" WHERE ("posts"."id" = 1)